In [2]:
import pandas as pd
users_table1=pd.read_csv("users_table1.csv",index_col=0)
users_table1.index=range(1,len(users_table1)+1)
users_table1

       Names  Age     Occupation  Salary    Location
1       Mary   49     Accountant  229388        Oslo
2       Jane   24   Data Analyst  163110       Lagos
3    Hillary   30          Clerk  197852  Washington
4   Napoleon   41     Accountant  243500  Burcharest
5      Terry   32          Nurse   94631       Hanoi
6       Mane   39     Accountant  222427     Nairobi
7       Sane   48  Sales Manager  109141     Nairobi
8    Mamadou   24  Sales Manager   67726        Oslo
9     Claire   34          Clerk  274244      Moscow
10      Venn   30  Sales Manager   50863  Washington
11      Hill   44        Teacher  255092  Washington
12      Joan   25        Teacher  110967     Nairobi
13     Peter   33        Teacher   62173      Warsaw
14     James   23          Nurse   59885     Nairobi
15      John   30          Nurse  112031      Warsaw

In [6]:
#check for missing values in users_table1
users_table1.isnull().any()

Names         False
Age           False
Occupation    False
Salary        False
Location      False
dtype: bool

In [3]:
#users table2
users_table2=pd.read_csv("users_table2.csv",index_col=0)
#reset index
users_table2.index=range(1,len(users_table2)+1)
users_table2

         Name  Age   Occupation  Salary Location
1      Amelia   25      Plumber   96358   Moscow
2   Alexander   32      Plumber   90588    Lagos
3       Clark   41   Accountant   78541    Lagos
4     Everlyn   41   Accountant   71213    Lagos
5       Lopez   44      Plumber   75373   Moscow
6      Lamine   39  Sales Agent   82770   Mumbai
7      Fermin   43  Sales Agent   78292   Mumbai
8        Diaz   40   Accountant   98226    Lagos
9       Dante   31      Teacher   72366  Nairobi
10    Welbeck   40  Sales Agent   97240    Lagos
11      Sisse   36      Teacher   99399  Nairobi
12       Pato   28        Pilot   53897   Mumbai
13       Alex   38      Teacher   84028   Mumbai
14    Mathias   35  Sales Agent   60754    Lagos
15       Mark   32        Pilot   63512   Tehran

In [7]:
#check for missing values in users_table2
users_table2.isnull().any()

Name          False
Age           False
Occupation    False
Salary        False
Location      False
dtype: bool

In [9]:
#get summary for salary column for users_table1
users_table1['Salary'].describe()
# count: 15 - There are 15 salary records in the dataset (no missing values).
# mean: $150,202 - The average salary across all 15 employees is about $150,200.
# std: $79,895 - This is the standard deviation
# showing salaries vary widely from the average by roughly $80,000
# This indicates significant salary dispersion in your dataset.
# min: $50,863 - The lowest salary in the dataset is about $50,900.
# 25% (first quartile): $81,179 - 25% of employees earn $81,179 or less.
# 50% (median): $112,031 - Half the employees earn below $112,031 and half earn above it.
# this is considerably lower than the mean ($150,202),
# suggesting the distribution is right-skewed with some high earners pulling the average up.
# 75% (third quartile): $225,908 - 75% of employees earn less than $225,908,
# meaning only the top 25% earn more than this.
#max: $274,244 - The highest salary is about $274,200.
#The large gap between the median ($112,031) and mean ($150,202)
#plus the high standard deviation
#suggests that likely there are  a few high earners significantly above the rest
# The salary range spans from about $51K to $274K, showing substantial variation in compensation levels.

count        15.00000
mean     150202.00000
std       79894.66454
min       50863.00000
25%       81178.50000
50%      112031.00000
75%      225907.50000
max      274244.00000
Name: Salary, dtype: float64

In [12]:
#get salary summary for users_table2
users_table2['Salary'].describe()
#count is 15
#there are no missing values
#mean is roughly 80k 
#thats the aveage salary for all 15 employees
#std: standard deviation is roughly 14k
#showing variations from the mean by roughly 14k 
#lowest salary is about 53800
#25% of employees earn less than 71k
#50% half of employees earn more than 78k and half earn less than 78k
#75% of employees earn less than 93k
#only top 25% earn more than 93k
#mean is higher than median
#data is right skewed
#suggesting we have few high earners pulling the average upwards
#maximum salary is roughly 99k
#overall,salary spans from 53k to 99k
#showing slight variations in salary compensations

count       15.000000
mean     80170.466667
std      14378.682767
min      53897.000000
25%      71789.500000
50%      78541.000000
75%      93473.000000
max      99399.000000
Name: Salary, dtype: float64